recipes_list = [
    {
        "title": "Борщ", #1
        "image": "1.jpg",
        "time": 90,
        "ingredients": [
            "Говядина", "Свекла", "Картофель", "Морковь",
            "Лук репчатый", "Капуста", "Чеснок",
        ],

        "ingredients_info": """- Говядина: 500 - 700 г.
- Свекла: 2 шт. среднего размера.
- Картофель: 4-5 шт.
- Морковь — 1–2 шт.
- Лук репчатый — 1–2 шт.
- Капуста: 300 г.
- Томатная паста — 2 ст. л.
- Растительное масло — 2–3 ст. л.
- Чеснок: 2-3 зубчика.
- Сахар — 1 ч. л.
- Уксус 9% — 1 ч. л. (для сохранения цвета свёклы).
- Лавровый лист — 1–2 шт.
- Чёрный перец горошком — 6–8 шт.
- Соль — по вкусу.""",

        "instructions": """1. Мясо: Возьмите говядину на кости или свинину для навара.
2. Вода: Промойте мясо и залейте холодной водой.
3. Кипение: Доведите до кипения на сильном огне.
4. Пена: Обязательно снимите всю пену, чтобы бульон был прозрачным.
5. Огонь: Убавьте огонь до минимума, чтобы вода едва кипела.
6. Специи: Добавьте лук, морковь, лавровый лист и перец для аромата.
7. Время: Варите 1.5–2 часа, пока мясо не станет мягким.
8. Финал: Процедите бульон и нарежьте мясо кусочками.
                    """
    },
{
        "title": "Жареные пельмени со сметаной", #2
        "image": "2.jpg",
        "time": 15,
        "ingredients": ["Пельмени", "Сметана", "Сыр твёрдый", "Укроп", "Вода", "Перец свежемолотый", "Соль", "Масло растительное"],

        "ingredients_info": """- Пельмени: 400 г.
- Сметана: 100 мл.
- Сыр твёрдый: 100 г.
- Укроп: 1 пучок.
- Вода: 100 мл.
- Перец свежемолотый: 100 мл.
- Соль — по вкусу 
- Масло растительное: Сколько хотите, главное не переборщите:).""",

        "instructions": """1. Масло: Ставим сковородку на сильный огонь и наливаем растительное масло, после даём ему разогреться.
2. Пельмени: Когда масло разогрелось закидываем наши пельмени и обжариваем 6-8 минут, чтобы на них образовалась корочка.
3. Сметана и вода: Пока наши пельмешки обжариваются, смешиваем сметану с теплой водой.
4. Соль: Присаливаем получившуюся смесь.
5. Перец: Добавляем свежемолотый перец и перемешиваем всё вместе до того момента, пока сметана полностью не растворится в воде.
6. Перемешка: Обжаренные пельмени заливаем сметанной смесью, после убавляем огонь до минимума и оставляем их готовиться на 10 минут, не забудьте несколько раз их перемешать!!!!!
7. Сыр: Пока наш шедевр готовиться, берём сыр и натираем его на мелкой тёрке, а когда же весь соус в сковороде впитается в пельмени, посыпаем готовое блюдо натёртым сыром и закрываем снова крышкой и даём сыру подплавиться. На это уйдёт не больше пару минут.
8. Укроп: Мелко нарезаем небольшой пучок укропа и используем его для украшения блюда.
9. Финал: Приятного вам аппетита!)
        """
    },
{
        "title": "Селёдка под шубой.", #3
        "image": "3.jpg",
        "time": 90,
        "ingredients": ["Картофель", "Морковь", "Свекла", "Сельдь солёная", "Репчатый лук", "Майонез", "Яйцо"],

        "ingredients_info": """- Картофель: 500 г.
- Морковь: 500 г.
- Свекла: 500 г.
- Сельдь соленая: 1-2 штук.
- Репчатый лук: 100 г
- Перец свежемолотый: 100 мл.
- Яйцо: 4 штуки.""",

        "instructions": """1. Свекла: Заранее отварите свеклу до мягкости. На это уйдёт 1-2 часа. Затем остудите её. 
2. Морковь и картофель: Морковь и картофель также отварите в течение 30-40 минут. Овощи остудите. 
3. Яйца: Яйца сварите вкрутую. 
4. Сельдь: Селёдку разделайте, удалив голову, плавники, хвост и косточки, а потом нарежьте. Или же купите рыбу сразу кусочками.
5. Картофель: Очищенный картофель натрите на большой тёрке. 
6. Перемешка: Также натрите яйца, очищенную морковь и свеклу. 
7. Лук: Лук нашинкуйте. Чтобы он не горчил, залейте его кипятком на пару минут. Потом воду слейте. 
8. Картошка и майонез: Возьмите тарелку для подачи. Выложите первым слоем картофель. Смажьте его майонезом. 
9. Селёдка и лук: Дальше распределите слой из селёдки, а неё положите лук. 
9. Яйца и майонез: Потом распределите яйца, а сверху смажьте их майонезом. 
9. Морковь и майонез: Затем слой морковки с майонезом. 
9. свекла и майонез: А в конце свекла, политая майонезом. 
9. Финал: Оставьте салат на 3-4 часа в холодильнике, чтобы он пропитался. Приятного аппетита! 
        """
    },
{
        "title": "Макароны по-флотски", #4
        "image": "4.jpg",
        "time": 50,
        "ingredients": ["Макароны", "Говядина", "Лук репчатый", "Масло сливочное", "Вода", "Перец чёрный свежемолотый", "Соль", "Масло растительное"],

        "ingredients_info": """- Макароны: 225 г.
- Говядина или готовый фарш: 275 г.
- Лук репчатый: 175 г.
- Масло сливочное: 50 г.
- Вода: 1,25 л.
- Перец чёрный свежемолотый - по вкусу.
- Соль — по вкусу 
- Масло растительное: 3 столовых ложки""",

        "instructions": """1. Лук: Очищенный лук нарезать небольшими кубиками.
2. Растительное масло и лук: В сковороде разогреть 1 ст. ложку растительного масла. Выложить нарезанный лук и жарить, помешивая, 7-8 минут, до золотистого цвета.
3. Сливочное масло: После этого добавить к луку 25 г сливочного масла.
4. Растопить масло: Растопить масло и поджарить лук ещё 1-2 минуты на небольшом огне, пока не появится приятный сливочно-луковый аромат.
5. Говядина: Говядину нарезать кусочками и пропустить через мясорубку со средней решёткой.
6. Жарка фарша: Выложить мясной фарш на отдельную, хорошо разогретую сковороду. Постоянно разбивать фарш лопаткой, чтобы не оставалось крупных комочков. Жарить на огне чуть выше среднего, пока весь сок не испарится и фарш не поменяет цвет на серый, около 5 минут.
После этого влить в сковороду с фаршем 1 ст. ложку растительного масла, немного уменьшить огонь и жарить фарш до золотистого цвета и приятного аромата жареного мяса, ещё минут 7-8. В процессе жарки фарш не солить и не перчить.
7. Соль и перец: Готовый мясной фарш и обжаренный лук соединить. Добавить соль и перец, перемешать и оставить немного настояться.
8. Масло: К макаронам добавить 25 г сливочного масла. Перемешать.
9. фарш с луком: Добавить к макаронам в кастрюле фарш с луком. Всё хорошо перемешать.
10. Финал: Выложить макароны по-флотски в тарелку и подавать к столу. Это самые вкусные, сытные и аппетитные макароны! Приятного вам аппетита!
        """
    },
{
        "title": "Творожная запеканка", #5
        "image": "5.jpg",
        "time": 50,
        "ingredients": ["Творог", "Яйца", "Сахар", "Манка", "Молоко", "Разрыхлитель", "Соль", "Ванильный сахар", "Растительное масло"],

        "ingredients_info": """- Творог (желательно жирный 5–9%): 500 г.
- Яйца: 3 шт.
- Сахар: 100 г.
- Манка: 100 г.
- Молоко: 150 мл.
- Разрыхлитель: 1 чайная ложка.
- Соль: щепотка 
- Масло растительное: Сколько хотите, главное не переборщите:).""",

        "instructions": """1. Растительное масло: Разогрейте духовку до 180 °C. Смажьте форму для запекания растительным маслом.
2. Творог: Протрите творог через сито, тщательно разомните вилкой или взбейте блендером, чтобы не было комочков. Если творог слишком влажный, слегка отожмите лишнюю жидкость.
3. Манка: Залейте манку молоком и оставьте на 15 минут, чтобы она набухла.
4. Творог и яйца: Переложите творог в глубокую миску, добавьте к нему яйца и тщательно перемешайте.
5. Добавление в смесь: Добавьте в смесь сахар, ванильный сахар, набухшую манку, щепотку соли, разрыхлитель и снова перемешайте.
6. Выкладывание в форму: Аккуратно выложите полученную массу в подготовленную форму, разровняйте поверхность лопаткой или ложкой.
7. Финал: Поместите форму в заранее разогретую духовку и выпекайте около 40–50 минут. Поверхность должна стать золотистой и упругой. Вот и получилась наша запеканка, приятного аппетита!)
        """
    },
{
        "title": "Блины", #6
        "image": "6.jpg",
        "time": 35,
        "ingredients": ["Мука пшеничная", "Яйца", "Молоко", "Сахар", "Сливочное масло", "Соль"],

        "ingredients_info": """- Мука пшеничная: 125 г.
- Яйца: 2 шт.
- Молоко: 300 мл.
- Сахар: 1 ст ложку.
- Сливочное масло: 1 ст ложку.
- Соль: небольшая щепотка""",

        "instructions": """1. Яйца: Взять яйца и хорошенько взбить.
2. Сахар, соль, молоко: Всыпать сахар, соль, влить небольшую часть молока из общей нормы, ещё раз перемешать.
3. Масло: Добавить размягчённое масло и частями вмешать муку до однородности теста.
4. Молоко: Так как ёмкость блендера может быть маловата, перелить содержимое в миску побольше. Добавить оставшееся молоко и ещё раз перемешать.
5. Духовка: Противень размером примерно 36×23 см застелить пекарской бумагой, сформировать бортики, чтобы тесто не вылилось. Вылить тесто и поставить в заранее разогретый до 200 °C духовой шкаф.
6. Финал: Выпекать примерно 20–30 минут до зарумянивания (ориентируйтесь на особенности своей духовки). Приятного аппетита!!!
        """
    },
{
        "title": "Сырники", #7
        "image": "7.jpg",
        "time": 20,
        "ingredients": ["Творог", "Яйца", "Сахар", "Растительное масло", "Мука"],

        "ingredients_info": """- Мука: 5–6 ст.л.
- Яйца: 1 шт.
- Творог(жирный, не сухой): 500 г.
- Сахар: 4 ст.л.
- Растительное масло - для жарки.""",

        "instructions": """1. Творог, яйцо, сахар: Разомните творог вилкой, добавьте яйцо и сахар, перемешайте.
2. Мука: Добавьте муку, перемешайте. Масса должна собираться в ком и держать форму. При необходимости добавьте ещё муки.
3. Творог и Мука: Влажными руками возьмите столовую ложку творожной массы, сформируйте шарик, приплющите его и обваляйте в муке с двух сторон.
4. Финал: На хорошо разогретую сковороду с растительным маслом выложите сырники и жарьте на среднем огне до румяной корочки, периодически переворачивая. Приятного аппетита!
        """
    },
{
        "title": "Королевская ватрушка", #8
        "image": "8.jpg",
        "time": 50,
        "ingredients": ["Мука", "Яйца", "Разрыхлитель", "Сахар", "Сливочное масло", "Соль", "Творог", "Ванилин"],

        "ingredients_info": """- Мука: 300 г.
- Яйца: 3 шт.
- Сахар: 250 г.
- Сливочное масло: 150 г.
- Соль: небольшая щепотка
- Разрыхлитель: 1 чайная ложка
- Творог: 400 г
- Ванилин: Немного
""",

        "instructions": """1. Мука: В глубокой миске хорошо перемешайте муку, сахар и разрыхлитель.
2. Растительное масло: Растопите масло, немного остудите, влейте в мучную смесь и перемешайте до состояния крошки.
3. Творог, яйца, сахар: В отдельной миске с помощью блендера соедините творог, яйца, сахар и ванилин до однородной массы.
4. Сливочное масло: Форму диаметром от 20 см смажьте сливочным маслом.
5. Крошка: Выложите на дно примерно две трети крошки и равномерно распределите, слегка утрамбовывая ложкой или рукой.
6. Творожная масса: Равномерно распределите творожную массу поверх основы.
7. Начинка: Засыпьте начинку оставшейся крошкой. Не прижимайте крошку к ватрушке, чтобы во время запекания образовался красивый верх с золотистыми крошками.
8. Духовка: Поставьте пирог в духовку, разогретую до 180 °C, и выпекайте 35–40 минут до золотистой корочки.
9. Финал: После приготовления немного остудите, выньте из формы и нарежьте небольшими кусочками для подачи. Приятного аппетита!!!
        """
    },
{
        "title": "Пицца Пепперони", #9
        "image": "9.jpg",
        "time": 110,
        "ingredients": ["Мука пшеничная", "Вода", "Дрожжи быстрорастворимые", "Растительное масло", "Соль", "Сахар", "Помидор (средний)", "Кетчуп", "Томатная паста", "Чеснок", "Приправа «Прованские травы»", "Паприка сладкая", "Перец чили", "Моцарелла", "Колбаса (сырокопчёная)"],

        "ingredients_info": """- Мука пшеничная: 250 г.
- Вода: 120 мл.
- Дрожжи быстрорастворимые: 10 г
- Масло растительное: 2 ст. л.
- Соль: 1 щепотка
- Сахар: 1 щепотка
- Помидор (средний): 1 шт
- Кетчуп: 1 ст. л
- Томатная паста: 1 ч. л
- Чеснок: 2 зубчика
- Паприка сладкая: 0,25 ч. л.
- Приправа «Прованские травы»: 1 ч. л.
- Перец чили: по вкусу
- Моцарелла: 120 г
- Колбаса (сырокопчёная): 100 г.""",

        "instructions": """1. Вода, сахар, соль, дрожи: В тёплой воде растворить сахар и соль. Всыпать дрожжи и аккуратно размешать до получения однородной смеси. Оставить подниматься на 15 минут до появления пышной «шапочки».
2. Мука, растительное масло: В глубокую миску просеять муку, сделать в центре муки углубление и влить в него поднявшиеся дрожжи и растительное масло. Замесить упругое однородное тесто. Вымешивать 7–10 минут, пока оно не начнёт отлипать от рук. При необходимости можно добавить ещё немного масла.
3. Миска: Миску с готовым тестом накрыть полотенцем и оставить подниматься в тёплом месте на 40–45 минут.
4. Помидор и вода: Помидоры вымыть, сделать сверху надрезы крест-накрест. Залить кипятком и оставить на пару минут, чтобы кожица начала сползать. Очищенный помидор нарезать дольками, удалив плодоножку. Очистить зубчики чеснока. В чашу блендера выложить помидоры, кетчуп, дольки чеснока, прованские травы и специи. Закрыть крышкой и взбить всё до однородности.
5. Томатная смесь и паста: В сковороде на среднем огне разогреть растительное масло. Аккуратно вылить в неё взбитую томатную смесь и добавить томатную пасту. Всё перемешать и тушить, помешивая, около 5 минут, пока соус не начнёт густеть. Готовый соус снять с огня и охладить.
6. Колбаса и моцарелла: Колбасу нарезать тонкими кружочками. Моцареллу натереть на крупной тёрке.
7. Тесто и мука: Подошедшее тесто обмять и раскатать в тонкую круглую лепёшку диаметром около 30 см, не забывая сформировать по краю небольшой бортик. Готовую лепёшку перенести на противень, присыпанный мукой. Обильно смазать её готовым соусом, не выходя за бортики. Сверху посыпать тёртым сыром. А затем на сыр равномерно выложить кружочки колбасы.
8. Финал: Выпекать пиццу 10 минут в духовке, заранее разогретой до 250 °C. Приятного аппетита!!!
        """
    },
{
        "title": "Солянка мясная", #10
        "image": "10.jpg",
        "time": 120,
        "ingredients": ["Говядина на кости", "Лук репчатый", "Морковь", "Солёные огурцы", "Сосиски", "Полукопчёная колбаса", "Охотничьи полукопчёные колбаски", "Ветчина", "Растительное масло", "Томатная паста", "Огуречный рассол", "Маслины без косточек", "Вода", "Соль", "Чёрный перец", "Лимон", "Зелень"],

        "ingredients_info": """- Говядина на кости: 500 г
- Лук репчатый: 2 шт.
- Морковь: 1 шт.
- Солёные огурцы: 4 шт.
- Сосиски: 2 шт.(130 г)
- Полукопчёная колбаса: 120 г
- Охотничьи полукопчёные колбаски: 70 г;
- Ветчина: 100 г
- Растительное масло: 3 ст. л.
- Томатная паста: 2 ст. л.
- Огуречный рассол: 150 мл
- Маслины без косточек: 60 г.
- Вода: 100 мл.
- Соль: по вкусу.
- Чёрный перец: по вкусу.
- Лимон: 1 шт.
- Зелень: 1 пучок.
""",

        "instructions": """1. Говядина, лук, вода: Приготовление бульона. Положите в кастрюлю говядину на кости и одну очищенную луковицу, залейте 2 литрами воды. Доведите почти до кипения, снимите пену. Доведите бульон до кипения, затем накройте крышкой и варите на медленном огне 1 час.
2. Лук. морковь, огурцы, сосиски, колбаски, ветчина: Нарежьте лук кубиками, морковь — натрите на крупной тёрке, огурцы — нарежьте кубиками, сосиски — нарежьте кружочками, колбасу — нарежьте соломкой, колбаски — нарежьте кружочками, ветчину — нарежьте кубиками.
3. Мясо, луковица: Выньте мясо и луковицу из бульона, дайте мясу остыть.
4. Растительное масло, лук, морковь: На сковороде разогрейте растительное масло, обжарьте лук до золотистого цвета, добавьте морковь и обжаривайте около 1 минуты. Добавьте нарезанные огурцы и томатную пасту, хорошо перемешайте. Влейте огуречный рассол, перемешайте и готовьте ещё около 2 минут. Добавьте все нарезанные колбасные изделия и сосиски, жарьте 5 минут.
5. Говядина: Остывшую говядину нарежьте кубиками. Горячий бульон снова поставьте на плиту и добавьте в него зажарку. Добавьте нарезанную говядину и маслины без косточек. Попробуйте на соль и добавьте по вкусу, при необходимости добавьте немного чёрного перца. Влейте 100 мл жидкости из-под маслин. Накройте крышкой, доведите до кипения и варите на слабом огне 7 минут.
6. Финал: Подавайте солянку горячей, добавив в каждую тарелку кружок лимона, посыпав зеленью и добавив сметану. Приятного аппетита!!!"""
    },
{
        "title": "Яичница-глазунья", #11
        "image": "11.jpg",
        "time": 10,
        "ingredients": ["Масло", "Яйца", "Чёрный перец", "Соль"],

        "ingredients_info": """- Масло(сливочное или растительное): 1 чайная ложка.
- Яйца: 2-3 шт.
- Чёрный перец: перец по желанию.
- Соль: по вкусу.""",

        "instructions": """1. Масло: Разогрейте сковороду на среднем огне и растопите масло. Дождитесь появления пузырьков.
2. Яйца: Аккуратно разбейте яйца на сковороду, стараясь не повредить желток. Можно сначала разбить яйцо в небольшую миску, а затем аккуратно вылить на сковороду — так меньше риск попадания скорлупы.
3. Жарка: Жарьте на минимальном или среднем огне примерно 2–4 минуты, пока белок не схватится, а желток останется жидким. Чтобы желток не затянулся белёсой плёнкой, сковороду лучше не накрывать. Если хотите, чтобы белок полностью схватился, а желток остался мягким, можно накрыть крышкой на 30–40 секунд. 
4. Соль и чёрный перец: Посолите и поперчите по вкусу непосредственно перед тем, как снять сковороду с огня.
5. Финал: Переложите готовую яичницу на тарелку. Можно украсить зеленью или добавить ломтики хлеба. Приятного аппетита!!!"""
    },
{
        "title": "Холодец", #12
        "image": "12.jpg",
        "time": "240-360",
        "ingredients": ["Свиные ножки(копытца)", "Говяжья голяшка", "Лук репчатый", "Морковь", "Чеснок", "Лавровый лист", "Соль", "Вода"],

        "ingredients_info": """- Свиные ножки(копытца): 2 шт
- Говяжья голяшка: примерно 1 кг;
- Лук репчатый: 2 шт
- Морковь: 2 шт.
- Чеснок: 1 головушка.
- Лавровый лист: по вкусу
- Чёрный перец горошком: по вкусу
- Соль: по вкусу
- Вода: 3 литра или сколько влезет в кастрюлю
""",

        "instructions": """1. Мясо: Мясо тщательно промыть, свиные копытца поскоблить.
2. Вода, мясо: Положить мясо в большую кастрюлю, наполнить её водой и поставить на плиту.
3. Бульон: Начать варить на среднем огне. Как только начнётся кипение и поднимется пена, слить эту воду, промыть мясо и кастрюлю. Это обязательный этап, без которого бульон не будет прозрачным.
4. Кипение: Повторно залить мясо чистой водой. Дождаться закипания, затем убавить огонь до минимума. Крышку лучше оставить слегка приоткрытой, чтобы стравливать пар.
5. Варка: Варить содержимое кастрюли 3–5 часов.
6. Лук, морковь: За 1 час до завершения варки положить в бульон луковицы и морковь. Добавить перец и остальные специи лучше всего за 20 минут до конца. Посолить бульон чуть крепче обычного, так как в холодном блюде соль чувствуется слабее.
7. Чеснок: Кастрюлю снять с огня, когда мясо начнёт без труда отходить от костей. После этого можно добавить в бульон измельчённый чеснок. Его не нужно варить, поскольку овощ должен не развариться, а лишь придать заливному пикантный аромат.
8. Финал: После варки отделить мясо от костей и разложить его по формам. Бульон процедить через плотную марлю, на которой должна остаться выделившаяся пена. Мясо залить бульоном, который после застывания превратится в желе. Убрать формы в холодное место. Приятного аппетита!"""
    },
{
        "title": "Шарлотка", #13
        "image": "13.jpg",
        "time": "30-45",
        "ingredients": ["Мука", "Яйца", "Сода", "Сахар", "Сливочное масло", "Соль", "Яблоки"],

        "ingredients_info": """- Мука: 1 стакан.
- Яйца: 3 шт.
- Сода: 0.3 чайной ложки.
- Сахар: 1 стакан.
- Сливочное масло: 10 гр.
- Соль: 1-2 щепотки.
- Яблоки: 5-6 штук. """,

        "instructions": """1. Яблоки: Яблоки разрезать на четыре части, удалить сердцевину с семенами, нарезать тонкими ломтиками. Можно снять кожуру для более нежной текстуры, но это не обязательно.
2. Сливочное масло: Форму для запекания смазать сливочным маслом.
3. Яблоки: Выложить яблоки равномерным слоем на дно формы.
4. Яйца, соль, сахар: В глубокую миску вбить яйца, добавить щепотки соли и стакан сахара. Взбивать до тех пор, пока масса не побелеет, не станет пышной и не увеличится в объёме. Лучше использовать миксер на средних оборотах.
5. Мука, сода: В последнюю очередь добавить муку и гашёную соду, аккуратно перемешать силиконовой лопаткой. Действовать нужно деликатно, чтобы масса не потеряла пышность.
6. Тесто, яблоки: Получившееся тесто вылить на яблоки, слегка встряхнуть форму для равномерного распределения. Не нужно перемешивать тесто с яблоками — классическая пышная шарлотка готовится по слоям: внизу яблоки, сверху — тесто.
7. Выпекание: Выпекать в заранее разогретой до 180 °C духовке 30–45 минут до румяной корочки.
8. Духовка: Выключить духовку, оставить шарлотку ещё на 5 минут внутри.
9. Финал: Остудить 10 минут при комнатной температуре, форму накрыть блюдом, перевернуть и позволить шарлотке переместиться на блюдо — так слой яблок окажется наверху. Приятного аппетита!!
        """
    },
{
        "title": "Омлет", #14
        "image": "14.jpg",
        "time": "15-20",
        "ingredients": ["Зелень", "Яйца", "Молоко", "Чёрный молотый перец", "Растительное масло", "Соль"],

        "ingredients_info": """- Зелень: по желанию.
- Яйца: 5 шт.
- Молоко: 150 мл.
- Чёрный молотый перец: по вкусу.
- Растительное масло: 2 ст ложки.
- Соль: по вкусу""",

        "instructions": """1. Яйца: Разбейте яйца в миску и слегка взбейте венчиком или вилкой до однородности.
2. Молоко: Влейте молоко, перемешайте до однородности. Не нужно взбивать до пены.
3. Соль чёрный молотый перец: Добавьте соль и чёрный молотый перец по вкусу, перемешайте.
4. Растительное масло: Разогрейте сковороду на среднем огне, налейте растительное масло.
5. Яичная масса: Аккуратно влейте яичную массу, накройте крышкой и убавьте огонь до минимального.
6. Финал: Готовьте 7–10 минут под крышкой, не открывая её, пока омлет не схватится сверху. Приятного аппетита!!!
        """
    },
{
        "title": "Рецепт яичницы на сковороде", #15
        "image": "15.jpg",
        "time": "5-10",
        "ingredients": ["Яйца", "Растительное или сливочное масло", "Соль"],

        "ingredients_info": """- Яйца: 1-3 шт.
- Растительное или сливочное масло: 1–2 ст. л.
- Соль: по вкусу""",

        "instructions": """1. Яйца: Выберите сковороду подходящего размера. Если она слишком большая, яйца растекутся тонким слоем и быстро подгорят. Если слишком маленькая — слой белка получится толстым и будет плохо прожариваться. 
2. Сковорода: Разогрейте сковороду на среднем огне. Если сковорода будет недостаточно горячей, яйца могут прилипнуть ко дну. Если слишком горячей — быстро подгорят. 
3. Масло: Налейте масло и дождитесь, пока оно прогреется. 
4. Яйца: Аккуратно разбейте яйца на сковороду, стараясь не повредить желтки. Можно сначала разбить яйца в миску, а затем перелить на сковороду — так легче проверить, нет ли скорлупок или испорченного яйца. 
5. Соль: Посолите по вкусу. Солить лучше в конце приготовления, так как на желтке от соли могут остаться белые пятна
6. Финал: Жарьте на небольшом огне, пока белок полностью не схватится, а желток останется жидким. Важно не перегреть, чтобы желток не затянулся белой плёнкой. Потом положите на тарелки и наслаждайтесь этим шедевром. Приятного аппетита!!!
        """
    },
{
        "title": "Салат капрезе-лайт", #16
        "image": "16.jpg",
        "time": "10-15",
        "ingredients": ["Спелые помидоры", "Моцарелла", "Сода", "Свежий базилик", "Оливковое масло", "Бальзамический уксус", "Свежемолотый чёрный перец"],

        "ingredients_info": """- Спелые помидоры: сколько хотите.
- Моцарелла: сколько хотите.
- Свежий базилик: 10–15 листьев.
- Оливковое масло: сколько хотите, главное не переборщите.
- Бальзамический уксус: сколько хотите, главное не переборщите.
- Соль: по вкусу.
- Свежемолотый чёрный перец: по вкусу.""",

        "instructions": """1. Помидоры: Помидоры вымойте и нарежьте тонкими кружочками толщиной около 5 мм. Важно, чтобы они были спелыми, но не водянистыми.
2. Моцарелла: Моцареллу слейте от рассола и тоже нарежьте кружочками аналогичной толщины. Если используете буррату, разрежьте её пополам и выложите сердцевину на блюдо.
3. Помидоры, базилик, моцарелла: На плоской тарелке чередуйте слои: помидор, моцарелла, лист базилика. Начните и закончите помидором для гармонии цветов.
4. Оливковое масло, соль, перец, уксус: Сбрызните салат оливковым маслом, капните бальзамическим уксусом и посыпьте солью с перцем.
5. финал: Дайте постоять 5 минут, чтобы вкусы пропитались. Приятного аппетита!!
        """
    },
{
        "title": "Банановые оладьи", #17
        "image": "17.jpg",
        "time": "20-30",
        "ingredients": ["Мука", "Яйца", "Сахар", "Разрыхлитель", "Бананы"],

        "ingredients_info": """- Мука: 4-5 ст.л.
- Яйца: 1 шт.
- Разрыхлитель: 1 ч.л.
- Сахар: 1 ст.л.
- Бананы: 2 штуки. """,

        "instructions": """1. Бананы: Очистите бананы от кожуры и разомните их вилкой в пюре.
2. Яйцо, сахар: Добавьте к бананам яйцо и сахар, перемешайте.
3. Молоко: Смешайте полученную массу и молоко до однородности.
4. Мука и разрыхлитель: В отдельной ёмкости смешайте муку с разрыхлителем.
5. Банановая смесь: Просейте сухие ингредиенты в банановую смесь и перемешайте, чтобы не осталось комочков.
6. Духовка: Разогрейте духовку до 180 °C.
7. Финал: Выкладывайте тесто ложкой, формируя оладьи, и запекайте примерно 15–20 минут до золотистой корочки. Приятного аппетита!!
        """
    },
{
        "title": "Овсяноблин", #18
        "image": "18.jpg",
        "time": 30,
        "ingredients": ["Овсяные хлопья", "Яйца", "Молоко", "Соль"],

        "ingredients_info": """- Овсяные хлопья: 3 ст.л.
- Яйца: 1 шт.
- Молоко: 50 мл.
- Соль: по вкусу. """,

        "instructions": """1. Овсяные хлопья, молоко, яйцо, щепотка соли: В глубокой миске соедините овсяные хлопья, молоко, щепотку соли и куриное яйцо.
2. Перемешка: Тщательно перемешайте и оставьте массу на 10–15 минут. За это время хлопья заметно набухнут, впитав в себя часть жидкости.
3. Тесто: Круглую жаропрочную форму застелите пергаментом и выложите тесто, распределив его по всему дну.
4. Финал: Выпекайте овсяноблин в духовке в течение 10–15 минут при температуре 180 °C. На поверхности блина не должно остаться мокрых участков — ориентируйтесь на особенности своей духовки. Приятного аппетита!!
        """
    },
{
        "title": "Паста Альо-Олио", #19
        "image": "19.jpg",
        "time": 15,
        "ingredients": ["Спагетти", "Чеснок", "Петрушка", "Оливковое масло", "Соль"],

        "ingredients_info": """- Спагетти: 500 г
- Чеснок: 4 крупных зубчика;
- Петрушка: небольшой пучок
- Оливковое масло: 8 ст.л.
- Соль: по вкусу.""",

        "instructions": """1. Чеснок, петрушка, листья: Очистите чеснок, раздавите плоской стороной ножа и порубите. У петрушки удалите стебли, листья очень мелко нарежьте.
2. Спагетти: Сварите спагетти согласно инструкции на упаковке, откиньте на дуршлаг и сохраняйте тёплыми.
3. Оливковое масло, чеснок: В сковороде с толстым дном нагрейте оливковое масло, добавьте чеснок, уменьшите огонь до минимума и, постоянно помешивая, обжаривайте 2 минуты. За 30 секунд до готовности высыпьте соль и петрушку.
4. Финал: Перемешайте с горячими спагетти и подавайте немедленно. Приятного аппетита!!
        """
    },
{
        "title": "Курица в соевом соусе", #20
        "image": "20.jpg",
        "time": 60,
        "ingredients": ["Куриные бёдра", "Соевый соус", "Мёд", "чеснок", "Имбирь", "Соль", "Сушёный тимьян или орегано", "Растительное масло"],

        "ingredients_info": """- Куриные бёдра: 1 кг.
- Соевый соус: 100 мл.
- Мёд: 2 ст.л.
- Чеснок: 3 зубчика.
- Имбирь: 2 см корня.
- Соль: 1-2 щепотки.
- Чёрный перец: 1-2 щепотки.
- Растительное масло: 1 ст.л.
- Сушёный тимьян или орегано: 1 ч.л.""",

        "instructions": """1. Курица: Тщательно промойте курицу и обсушите бумажным полотенцем. Если используете бёдра, можно сделать несколько надрезов, чтобы маринад лучше пропитал мясо.
2. Соевый соус: В миске смешайте соевый соус, мёд, растительное масло, измельчённый чеснок и тёртый имбирь. Добавьте тимьян, чёрный перец и щепотку соли (учитывайте, что соевый соус уже солёный).
3. Курица: Положите курицу в глубокую миску или пакет с застёжкой, залейте её маринадом. Перемешайте, чтобы кусочки мяса были полностью покрыты маринадом. Оставьте курицу мариноваться на 30–60 минут в холодильнике.
4. Курица, растительное масло: Разогрейте духовку до 200 °C. Выложите курицу в форму для запекания, смазанную растительным маслом. Оставшийся маринад можно полить сверху для дополнительного вкуса.
5. Финал: Поставьте форму с курицей в разогретую духовку. Запекайте 40–45 минут, периодически поливая мясо выделяющимся соком. Готовность можно проверить, проткнув курицу ножом — сок должен быть прозрачным. Приятного аппетита!!
        """
    },
{
        "title": "Белая рыба с лимоном", #21
        "image": "21.jpg",
        "time": 30,
        "ingredients": ["Филе белой рыбы", "Лимон", "Соль", "Чёрный молотый перец", "Сливочное масло"],

        "ingredients_info": """- Филе белой рыбы: 400–700 г
- Лимон — 1 штука.
- Сливочное масло: 4 ст.л.
- Соль: по вкусу.
- Чёрный молотый перец: по вкусу. """,

        "instructions": """1. Рыба: Рыбу разрежьте на порционные кусочки среднего размера. Посолите и поперчите со всех сторон. Для блюда можно использовать разные виды белой рыбы, главное, чтобы филе было плотным и не слишком тонким, иначе оно может получиться сухим.
2. Лимон: Мелкой тёркой или острым ножом снимите с лимона половину цедры. Из половинки лимона выжмите сок, от оставшейся отрежьте несколько тонких ломтиков по количеству рыбных кусочков.
3. Сковорода В сковороде растопите половину масла на среднем огне. Обжаривайте рыбу по одной-две минуты с каждой стороны.
4. Лимонный сок: Переложите рыбу в форму для запекания, сбрызните половиной лимонного сока. На каждый кусочек выложите по лимонному ломтику.
5. Духовка: Поставьте в разогретую до 200 °С духовку примерно на 10 минут. Время приготовления может немного меняться в зависимости от размера кусочков.
6. Финал: Пока рыба запекается, растопите оставшееся масло, смешайте с цедрой и лимонным соком. Запечённую рыбу достаньте из духовки, полейте соусом и сразу же подавайте к столу. Приятного аппетита!!
        """
    },
{
        "title": "Французские тосты", #22
        "image": "22.jpg",
        "time": 40,
        "ingredients": ["Тостовый хлеб", "Яйца", "Корица молотая", "Сахар", "Сливочное масло", "Соль", "Ванильный сахар", "Молоко", "Растительное масло", "Мёд"],

        "ingredients_info": """- Тостовый хлеб: 8 кусочков
- Яйца: 3 шт.
- Сахар: 2 ст.л.
- Сливочное масло: 2-3 ст.л.
- Соль: 1 щепотка.
- Корица молотая: 1 ч.л. 
- Ванильный сахар: 10 г.
- Молоко: 250 мл
- Растительное масло: 1 ст.л.
- Мёд: для подачи (по желанию)""",

        "instructions": """1. Растительное масло: Выстелите противень для запекания пекарской бумагой и смажьте растительным маслом.
2. Сахар, корица: Смешайте 2 ст. л. сахара и 1 чайную ложку молотой корицы — эта смесь понадобится для посыпки тостов.
3. Хлеб: Разрежьте каждый ломтик черствого тостового хлеба на 3 части.
4. Яйца, молоко, ванильный сахар: Соедините яйца, молоко и ванильный сахар, добавьте щепотку соли и смешайте до получения однородной массы.
5. Хлеб: Обмакните кусочки хлеба в яично-молочную смесь с двух сторон и выложите на подготовленную бумагу для запекания.
6. Сливочное масло: Смажьте кусочки хлеба растопленным сливочным маслом.
7. Присыпка: Присыпьте смесью сахара и корицы.
8. Духовка: Поместите тосты в разогретую до 175 °C духовку. Выпекайте 13–15 минут с одной стороны.
9. Масло, корица: Переверните, смажьте маслом и присыпьте сахаром и корицей с другой стороны.
10. Финал: Снова поместите в духовку и выпекайте ещё 15 минут до золотистого цвета. Приятного аппетита!!"""
    },
{
        "title": "Гренки с чесноком и сыром", #23
        "image": "23.jpg",
        "time": "10-15",
        "ingredients": ["Хлеб", "Твёрдый сыр", "Чеснок", "Растительное масло", "Сливочное масло"],

        "ingredients_info": """- Хлеб: 1 шт.
- Твёрдый сыр: 70 г.
- Чеснок: 1–2 зубчика.
- Растительное масло: 1 ч. л.
- Сливочное масло: 100 г. """,

        "instructions": """1. Хлеб: Нарежьте хлеб небольшими ломтиками и разогрейте духовку до 180 °C.
2. Чеснок, сливочное масло: Мелко порубите оставшийся чеснок и смешайте с сливочным маслом.
3. Хлеб: Смажьте получившейся смесью каждый кусок хлеба.
4. Растительное масло: Противень смажьте растительным маслом, разложите на нём ломтики хлеба.
5. Сыр: Натрите твёрдый сыр на мелкой тёрке и аккуратно посыпьте им хлеб на противне.
6. Финал: Отправьте противень в разогретую до 200 °C духовку примерно на 10 минут (или до румяной сырной корочки). Приятного аппетита!!"""
    },
{
        "title": "Ленивые вареники", #24
        "image": "24.jpg",
        "time": 25,
        "ingredients": ["Творог", "Яйцо", "Мука пшеничная", "Сахар", "Растительное масло", "Соль", "Ванильный сахар"],

        "ingredients_info": """- Творог: 400 г (любой жирности).
Яйцо: 1 шт.
Мука пшеничная: 6 ст.л.
Сахар: 3 ст.л.
соль: 1 щепотка.
Растительное масло: 20 мл.
Ванильный сахар: 2 щепотки. """,

        "instructions": """1. Творог, сахар, соль, яйцо: Выложите творог в глубокую ёмкость, всыпьте сахар, соль и вбейте яйцо. Тщательно перемешайте.
2. Мука: Добавьте муку и ванильный сахар. Замесите творожное тесто.
3. Тесто: Разделите тесто на две части и сформируйте из каждой из них небольшую колбаску. Подпылите рабочую поверхность мукой, чтобы тесто не прилипало.
4. Колбаса: Нарежьте колбаски на одинаковые кусочки.
5. Масло: Смажьте пекарскую бумагу или противень маслом и выложите на них нарезку творожного теста. Смажьте ломтики маслом и сверху.
6. Финал: Разогрейте духовку до 180 °C и запеките ленивые вареники примерно 15 минут. Время приготовления зависит от величины нарезки. Приятного аппетита!!
        """
    },
{
        "title": "Шакшука для ленивых", #25
        "image": "25.jpg",
        "time": 30,
        "ingredients": ["Яйца куриные", "Помидоры", "Болгарский красный перец", "Репчатый лук", "Чеснок", "Растительное масло", "Базилик сушёный", "Соль", "Чёрный перец"],

        "ingredients_info": """- Яйца куриные: 3 шт.
- Помидоры: 150 г.
- Болгарский красный перец: 100 г.
- Репчатый лук: 50 г.
- Чеснок: 1 зубчик.
- Растительное масло: 40 г.
- Базилик сушёный: 0,5 ч.л.
- Соль: по вкусу.
- Чёрный перец: по вкусу.""",

        "instructions": """1. Лук, чеснок: Почистите репчатый лук и чеснок. Лук нарежьте мелкими кубиками, а чеснок — ещё мельче.
2. Помидоры, перец: Нарежьте средними кусочками помидоры. Сладкий болгарский перец очистите от семян и также нарежьте средними кубиками.
3. Растительное масло, лук. чеснок: Разогрейте растительное масло на сковороде, всыпьте лук и чеснок, обжаривайте их до прозрачности (1–2 минуты).
4. Помидоры, сладкий перец: Добавьте в сковороду помидоры и сладкий перец. Тушите на небольшом огне 5–6 минут, добавьте чуть соли и чёрного перца, присыпьте сушёным базиликом. Перемешайте и готовьте ещё пару минут, чтобы выделился овощной сок.
5. Яйца: Все овощи с соусом переложите в форму для запекания, сделайте углубления и вбейте туда куриные яйца. Яйца слегка посолите, поперчите.
6. Финал: Запекайте шакшуку в духовке при 180 °С около 20 минут. Приятного аппетита!!"""
    },
]
