recipes_list = [
    {
        "title": "Борщ", #1
        "image": "1.jpg",
        "time": 90,
        "ingredients": [
            "Говядина", "Свекла", "Картофель", "Морковь",
            "Лук репчатый", "Капуста", "Чеснок",
        ],

        "ingredients_info": """- Говядина: 500 - 700 г.
- Свекла: 2 шт. среднего размера.
- Картофель: 4-5 шт.
- Морковь — 1–2 шт.
- Лук репчатый — 1–2 шт.
- Капуста: 300 г.
- Томатная паста — 2 ст. л.
- Растительное масло — 2–3 ст. л.
- Чеснок: 2-3 зубчика.
- Сахар — 1 ч. л.
- Уксус 9% — 1 ч. л. (для сохранения цвета свёклы).
- Лавровый лист — 1–2 шт.
- Чёрный перец горошком — 6–8 шт.
- Соль — по вкусу.""",

        "instructions": """1. Мясо: Возьмите говядину на кости или свинину для навара.
2. Вода: Промойте мясо и залейте холодной водой.
3. Кипение: Доведите до кипения на сильном огне.
4. Пена: Обязательно снимите всю пену, чтобы бульон был прозрачным.
5. Огонь: Убавьте огонь до минимума, чтобы вода едва кипела.
6. Специи: Добавьте лук, морковь, лавровый лист и перец для аромата.
7. Время: Варите 1.5–2 часа, пока мясо не станет мягким.
8. Финал: Процедите бульон и нарежьте мясо кусочками.
                    """
    },
    {
        "title": "Жареные пельмени со сметаной и сыром в сковороде", #2
        "image": "2.jpg",
        "time": 15,
        "ingredients": ["Пельмени", "Сметана", "Сыр твёрдый", "Укроп", "Вода", "Перец свежемолотый", "Соль", "Масло растительное"],

        "ingredients_info": """- Пельмени: 400 г.
- Сметана: 100 мл.
- Сыр твёрдый: 100 г.
- Укроп: 1 пучок.
- Вода: 100 мл.
- Перец свежемолотый: 100 мл.
- Соль — по вкусу 
- Масло растительное: Сколько хотите, главное не переборщите:).""",

        "instructions": """1. Масло: Ставим сковородку на сильный огонь и наливаем растительное масло, после даём ему разогреться.
2. Пельмени: Когда масло разогрелось закидываем наши пельмени и обжариваем 6-8 минут, чтобы на них образовалась корочка.
3. Сметана и вода: Пока наши пельмешки обжариваются, смешиваем сметану с теплой водой.
4. Соль: Присаливаем получившуюся смесь.
5. Перец: Добавляем свежемолотый перец и перемешиваем всё вместе до того момента, пока сметана полностью не растворится в воде.
6. Перемешка: Обжаренные пельмени заливаем сметанной смесью, после убавляем огонь до минимума и оставляем их готовиться на 10 минут, не забудьте несколько раз их перемешать!!!!!
7. Сыр: Пока наш шедевр готовиться, берём сыр и натираем его на мелкой тёрке, а когда же весь соус в сковороде впитается в пельмени, посыпаем готовое блюдо натёртым сыром и закрываем снова крышкой и даём сыру подплавиться. На это уйдёт не больше пару минут.
8. Укроп: Мелко нарезаем небольшой пучок укропа и используем его для украшения блюда.
9. Финал: Приятного вам аппетита!)
        """
    },
    {
        "title": "Селёдка под шубой.", #3
        "image": "3.jpg",
        "time": 90,
        "ingredients": ["Картофель", "Морковь", "Свекла", "Сельдь солёная", "Репчатый лук", "Майонез", "Яйцо"],

        "ingredients_info": """- Картофель: 500 г.
- Морковь: 500 г.
- Свекла: 500 г.
- Сельдь соленая: 1-2 штук.
- Репчатый лук: 100 г
- Перец свежемолотый: 100 мл.
- Яйцо: 4 штуки.""",

        "instructions": """1. Свекла: Заранее отварите свеклу до мягкости. На это уйдёт 1-2 часа. Затем остудите её. 
2. Морковь и картофель: Морковь и картофель также отварите в течение 30-40 минут. Овощи остудите. 
3. Яйца: Яйца сварите вкрутую. 
4. Сельдь: Селёдку разделайте, удалив голову, плавники, хвост и косточки, а потом нарежьте. Или же купите рыбу сразу кусочками.
5. Картофель: Очищенный картофель натрите на большой тёрке. 
6. Перемешка: Также натрите яйца, очищенную морковь и свеклу. 
7. Лук: Лук нашинкуйте. Чтобы он не горчил, залейте его кипятком на пару минут. Потом воду слейте. 
8. Картошка и майонез: Возьмите тарелку для подачи. Выложите первым слоем картофель. Смажьте его майонезом. 
9. Селёдка и лук: Дальше распределите слой из селёдки, а неё положите лук. 
9. Яйца и майонез: Потом распределите яйца, а сверху смажьте их майонезом. 
9. Морковь и майонез: Затем слой морковки с майонезом. 
9. свекла и майонез: А в конце свекла, политая майонезом. 
9. Финал: Оставьте салат на 3-4 часа в холодильнике, чтобы он пропитался. Приятного аппетита! 
        """
    },
{
        "title": "Макароны по-флотски", #4
        "image": "4.jpg",
        "time": 50,
        "ingredients": ["Макароны", "Говядина", "Лук репчатый", "Масло сливочное", "Вода", "Перец чёрный свежемолотый", "Соль", "Масло растительное"],

        "ingredients_info": """- Макароны: 225 г.
- Говядина или готовый фарш: 275 г.
- Лук репчатый: 175 г.
- Масло сливочное: 50 г.
- Вода: 1,25 л.
- Перец чёрный свежемолотый - по вкусу.
- Соль — по вкусу 
- Масло растительное: 3 столовых ложки""",

        "instructions": """1. Лук: Очищенный лук нарезать небольшими кубиками.
2. Растительное масло и лук: В сковороде разогреть 1 ст. ложку растительного масла. Выложить нарезанный лук и жарить, помешивая, 7-8 минут, до золотистого цвета.
3. Сливочное масло: После этого добавить к луку 25 г сливочного масла.
4. Растопить масло: Растопить масло и поджарить лук ещё 1-2 минуты на небольшом огне, пока не появится приятный сливочно-луковый аромат.
5. Говядина: Говядину нарезать кусочками и пропустить через мясорубку со средней решёткой.
6. Жарка фарша: Выложить мясной фарш на отдельную, хорошо разогретую сковороду. Постоянно разбивать фарш лопаткой, чтобы не оставалось крупных комочков. Жарить на огне чуть выше среднего, пока весь сок не испарится и фарш не поменяет цвет на серый, около 5 минут.
После этого влить в сковороду с фаршем 1 ст. ложку растительного масла, немного уменьшить огонь и жарить фарш до золотистого цвета и приятного аромата жареного мяса, ещё минут 7-8. В процессе жарки фарш не солить и не перчить.
7. Соль и перец: Готовый мясной фарш и обжаренный лук соединить. Добавить соль и перец, перемешать и оставить немного настояться.
8. Масло: К макаронам добавить 25 г сливочного масла. Перемешать.
9. фарш с луком: Добавить к макаронам в кастрюле фарш с луком. Всё хорошо перемешать.
10. Финал: Выложить макароны по-флотски в тарелку и подавать к столу. Это самые вкусные, сытные и аппетитные макароны! Приятного вам аппетита!
        """
    },
{
        "title": "Творожная запеканка", #5
        "image": "5.jpg",
        "time": 50,
        "ingredients": ["Творог", "Яйца", "Сахар", "Манка", "Молоко", "Разрыхлитель", "Соль", "Ванильный сахар", "Растительное масло"],

        "ingredients_info": """- Творог (желательно жирный 5–9%): 500 г.
- Яйца: 3 шт.
- Сахар: 100 г.
- Манка: 100 г.
- Молоко: 150 мл.
- Разрыхлитель: 1 чайная ложка.
- Соль: щепотка 
- Масло растительное: Сколько хотите, главное не переборщите:).""",

        "instructions": """1. Растительное масло: Разогрейте духовку до 180 °C. Смажьте форму для запекания растительным маслом.
2. Творог: Протрите творог через сито, тщательно разомните вилкой или взбейте блендером, чтобы не было комочков. Если творог слишком влажный, слегка отожмите лишнюю жидкость.
3. Манка: Залейте манку молоком и оставьте на 15 минут, чтобы она набухла.
4. Творог и яйца: Переложите творог в глубокую миску, добавьте к нему яйца и тщательно перемешайте.
5. Добавление в смесь: Добавьте в смесь сахар, ванильный сахар, набухшую манку, щепотку соли, разрыхлитель и снова перемешайте.
6. Выкладывание в форму: Аккуратно выложите полученную массу в подготовленную форму, разровняйте поверхность лопаткой или ложкой.
7. Финал: Поместите форму в заранее разогретую духовку и выпекайте около 40–50 минут. Поверхность должна стать золотистой и упругой. Вот и получилась наша запеканка, приятного аппетита!)
        """
    },
{
        "title": "Блины", #6
        "image": "6.jpg",
        "time": 35,
        "ingredients": ["Мука пшеничная", "Яйца", "Молоко", "Сахар", "Сливочное масло", "Соль"],

        "ingredients_info": """- Мука пшеничная: 125 г.
- Яйца: 2 шт.
- Молоко: 300 мл.
- Сахар: 1 ст ложку.
- Сливочное масло: 1 ст ложку.
- Соль: небольшая щепотка""",

        "instructions": """1. Яйца: Взять яйца и хорошенько взбить.
2. Сахар, соль, молоко: Всыпать сахар, соль, влить небольшую часть молока из общей нормы, ещё раз перемешать.
3. Масло: Добавить размягчённое масло и частями вмешать муку до однородности теста.
4. Молоко: Так как ёмкость блендера может быть маловата, перелить содержимое в миску побольше. Добавить оставшееся молоко и ещё раз перемешать.
5. Духовка: Противень размером примерно 36×23 см застелить пекарской бумагой, сформировать бортики, чтобы тесто не вылилось. Вылить тесто и поставить в заранее разогретый до 200 °C духовой шкаф.
6. Финал: Выпекать примерно 20–30 минут до зарумянивания (ориентируйтесь на особенности своей духовки). Приятного аппетита!!!
        """
    },

]
