recipes_list = [
    {
        "title": "Борщ",
        "image": "1.jpg",
        "time": 90,
        "ingredients": [
            "Говядина", "Свекла", "Картофель", "Морковь",
            "Лук репчатый", "Капуста", "Чеснок",
        ],

        "ingredients_info": """- Говядина: 500-700 г.
- Свекла: 2 шт. среднего размера.
- Картофель: 4-5 шт.
- Морковь — 1–2 шт.
- Лук репчатый — 1–2 шт.
- Капуста: 300 г.
- Томатная паста — 2 ст. л.
- Растительное масло — 2–3 ст. л.
- Чеснок: 2-3 зубчика.
- Сахар — 1 ч. л.
- Уксус 9% — 1 ч. л. (для сохранения цвета свёклы).
- Лавровый лист — 1–2 шт.
- Чёрный перец горошком — 6–8 шт.
- Соль — по вкусу.""",

        "instructions": """1. Мясо: Возьмите говядину на кости или свинину для навара.
2. Вода: Промойте мясо и залейте холодной водой.
3. Кипение: Доведите до кипения на сильном огне.
4. Пена: Обязательно снимите всю пену, чтобы бульон был прозрачным.
5. Огонь: Убавьте огонь до минимума, чтобы вода едва кипела.
6. Специи: Добавьте лук, морковь, лавровый лист и перец для аромата.
7. Время: Варите 1.5–2 часа, пока мясо не станет мягким.
8. Финал: Процедите бульон и нарежьте мясо кусочками.
                    """
    },
    {
        "title": "",
        "image": "2.jpg",
        "time": 60,
        "ingredients": ["", "", "", ""],
        "ingredients_info": """- ..
- ..
- ..
- ..
...
        """,
        "instructions": """1. ..
2. ..
3. ..
...
        """
    },
# и так до 6 блюд
]
